{
  "backend/main.mo": "Actor defines student profiles, courses, announcements, and new site settings with admin‑restricted CRUD operations and authorization checks.",
  "backend/migration.mo": "Migration module upgrades stored state by adding default siteSettings while preserving existing data maps and counters.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Reference file containing short summaries of major frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and dark mode variants using OKLCH values.",
  "frontend/index.html": "Base HTML file loading the React app entry point and setting initial document metadata.",
  "frontend/README.md": "Frontend documentation describing features, setup instructions, and development workflow.",
  "frontend/src/App.tsx": "Main app router and layout configuration with protected routes, authentication checks, and conditional profile setup modal.",
  "frontend/src/components/admin/AnnouncementEditor.tsx": "Dialog form for creating and editing announcements with validation, default date logic, and React Query mutations.",
  "frontend/src/components/admin/AnnouncementList.tsx": "Displays a list of announcements with edit/delete actions and handles confirmation dialogs and mutations.",
  "frontend/src/components/admin/CourseEditor.tsx": "Form dialog for creating or editing a course, handling validation and create/update mutations.",
  "frontend/src/components/admin/CourseList.tsx": "Shows all courses in cards with edit/delete options, invoking CourseEditor and delete confirmation.",
  "frontend/src/components/admin/SiteSettingsPanel.tsx": "Manages site settings including contact details and logo upload with validation and update mutations.",
  "frontend/src/components/admin/StudentEditor.tsx": "Dialog for editing a student's profile with validation and update mutation support.",
  "frontend/src/components/admin/StudentList.tsx": "Displays all student profiles in a table with edit actions and handles loading, error, and empty states.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with logo, user role, profile menu, and logout handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Provides a modal form for creating a student profile with validation and submission via mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, exposing login, logout, and identity state management.",
  "frontend/src/hooks/useLogoObjectUrl.ts": "Converts logo byte data into an object URL and handles cleanup on updates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating student profiles, roles, courses, and announcements via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark theme styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccessDenied.tsx": "Displays an access-denied message with login prompts and navigation back to home.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with course, announcement, student, and settings management tabs.",
  "frontend/src/pages/AdminDiagnostics.tsx": "Shows authentication, role, and admin permission diagnostics for the current user.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showing site info, courses, announcements, logo, and login/dashboard options.",
  "frontend/src/pages/StudentDashboard.tsx": "Displays a student's profile, courses, and announcements in a tabbed dashboard view.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash routing), storing them in sessionStorage, and retrieving or clearing persisted values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project state file describing requirements, architecture notes, known issues, and existing features for the JK Tuition Center website."
}