{
  "backend/main.mo": "Defines core backend actor with authorization, data types, and state for students, courses, announcements, attendance, enrollments, and results, plus admin‑gated course management functions.",
  "feature_evidence.json": "Feature evidence report describing removal of the Caffeine branding footer and listing affected files, components, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including pages, hooks, components, and styles.",
  "frontend/index.css": "Global Tailwind base/theme definitions using OKLCH tokens for light and dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/PRODUCTION_DEPLOYMENT.md": "Guide for deploying the frontend to IC mainnet, including prerequisites and build steps.",
  "frontend/README.md": "Frontend overview covering features, tech stack, setup, authentication flow, and deployment checklist.",
  "frontend/src/App.tsx": "Main React app file defining routing, authentication guards, layouts, and dashboard routes.",
  "frontend/src/components/admin/AdminStudentAttendanceDialog.tsx": "Admin dialog for viewing and toggling a student’s attendance using a calendar with month navigation and status updates.",
  "frontend/src/components/admin/AnnouncementEditor.tsx": "Modal form for creating or editing announcements with title, message, and date fields using mutation hooks.",
  "frontend/src/components/admin/AnnouncementList.tsx": "Displays a list of announcements with edit and delete actions, opening AnnouncementEditor for modifications.",
  "frontend/src/components/admin/CourseEditor.tsx": "Dialog form for creating or updating courses, including title, description, instructor, schedule, and fee fields.",
  "frontend/src/components/admin/CourseList.tsx": "Renders a grid of courses with details and provides edit and delete controls via CourseEditor and mutation hooks.",
  "frontend/src/components/admin/EnrollmentManagementPanel.tsx": "Admin panel to view and manage enrollments by student or course, including approving, rejecting, and renewing requests.",
  "frontend/src/components/admin/ResultsPanel.tsx": "Interface for selecting students and courses and submitting test or daily results, along with viewing existing results.",
  "frontend/src/components/admin/SiteSettingsPanel.tsx": "Admin panel for editing site contact details and uploading a logo with validation and preview.",
  "frontend/src/components/admin/StudentEditor.tsx": "Dialog for editing a student's profile, validating form fields, and optionally uploading a new photo.",
  "frontend/src/components/admin/StudentList.tsx": "Displays a table of student profiles with options to edit profiles or manage attendance.",
  "frontend/src/components/attendance/AttendanceCalendar.tsx": "Reusable calendar component showing daily attendance states with navigation and optional interactivity.",
  "frontend/src/components/attendance/StudentAttendancePanel.tsx": "Student view that loads caller attendance data and displays it in a read‑only attendance calendar.",
  "frontend/src/components/layout/AppContainer.tsx": "Layout wrapper providing consistent page padding and centered content.",
  "frontend/src/components/layout/AppHeader.tsx": "Header bar showing logo, role badge, navigation links, and account menu with logout handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Form modal for creating a student profile, including validation, photo upload, preview, and submission via createStudentProfile.",
  "frontend/src/components/student/EnrollmentPanel.tsx": "Displays courses with enrollment status and allows students to request enrollment or renewal.",
  "frontend/src/components/student/ResultsPanel.tsx": "Fetches and displays a student's test and daily results with course names and formatted dates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useByteImageObjectUrl.ts": "Converts image bytes into an object URL for display and cleans up the URL on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context including login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useLogoObjectUrl.ts": "Creates an object URL from logo bytes for rendering and revokes it on cleanup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating student profiles, roles, courses, announcements, and admin-managed data via the actor API.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark OKLCH color tokens, layout utilities, and component surface classes.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AccessDenied.tsx": "UI page that prompts unauthenticated users to sign in or return home when access is restricted.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing stats and tabbed management interfaces for courses, announcements, students, and settings.",
  "frontend/src/pages/AdminDiagnostics.tsx": "Diagnostics page showing admin status, data connectivity checks, version info, and environment details.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page displaying hero content, course and announcement data, contact info, and sign‑in routing.",
  "frontend/src/pages/StudentDashboard.tsx": "Dashboard page fetching student profile, courses, and announcements and rendering profile details with panels for attendance, enrollment, and results.",
  "frontend/src/utils/attendanceDates.ts": "Utility functions for working with attendance dates, including month navigation, time conversion, and lookup creation.",
  "frontend/src/utils/fileToUint8Array.ts": "Converts a File object into a Uint8Array using FileReader for backend storage.",
  "frontend/src/utils/icEnv.ts": "Utilities for determining environment settings, production checks, and resolving asset paths on the Internet Computer.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/version.ts": "Defines app version metadata and provides functions to retrieve version and build info.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata tracking features, issues, and current development state for the JK Tuition Center app."
}